Merge pull request #49 from Sachindu-Nethmin/update-diagrams
Replace ASCII diagrams with Mermaid syntax
